import { EggFried } from "lucide-react"

const About = () => {
  return (
    <section id="about">
      <div className="container mt-[80px]">
        <h2 className="uppercase text-2xl font-semibold text-center"> :: เกี่ยวกับ</h2>
        <div className="
              w-[100%] sm:w-[80%] text-center pt-4 
              text-[16px] font-normal
              md:text-lg md:font-semibold 
              flex flex-col justify-center items-center mx-auto
        ">
          <div className="flex my-1">
            <EggFried  color="yellow" className="w-[130px] h-[100px] p-2" />
            <p>
              <span className="text-lg font-semibold text-[#ff0]"> เว็บไซต์นี้</span>จัดทำขึ้นเพื่อเผยแพร่ข้อมูลเกี่ยวกับไข่ 
              และเมนูอาหารที่ทำจากไข่ชนิดต่างๆ ไม่ว่าจะเป็นไข่ไก่ ไข่เป็ด ไข่นกกระทา ไข่มดแดง ซึ่งจะกล่าวถึงไข่ไก่เป็นหลัก
              เพราะนอกจากไข่ไก่จะมีคุณค่าทางโภชนาการแล้วยังมีราคาไม่แพง
              และหาซื้อได้ง่ายตามท้องตลาดทั่วไป
            </p>
            
          </div>
          <div className="flex my-1">
            <EggFried color="yellow" className="w-[130px] h-[100px]  p-2" />
            <p>
             <span className="text-lg font-semibold text-[#ff0]">ไข่ไก่</span>เป็นแหล่งโปรตีนที่มีคุณภาพสูง
              มีกรดอะมิโนที่จำเป็นต่อร่างกาย
              และมีวิตามินและแร่ธาตุที่สำคัญต่อการเจริญเติบโตและพัฒนาการของร่างกาย
            </p>
          </div>
          <div className="flex my-1">
            <EggFried color="yellow" className="w-[130px] h-[100px] p-2" />
            <p>
              <span className="text-lg font-semibold text-[#ff0]">เว็บไซต์นี้</span>จึงมีวัตถุประสงค์เพื่อให้ข้อมูลที่ถูกต้องและเป็นประโยชน์
              สำหรับผู้ที่สนใจเกี่ยวกับไข่และเมนูอาหารที่ทำจากไข่ชนิดต่างๆ 
              เพื่อให้ผู้ที่สนใจ สามารถรับทราบข้อมูลได้ครอบคลุมที่สุดในที่เดียว
            </p>
          </div>
          <div className="flex my-1">
            <EggFried color="yellow" className="w-[130px] h-[100px] p-2" />
            <p>
              <span className="text-lg font-semibold text-[#ff0]">โดยข้อมูล</span>ที่นำเสนอในเว็บไซต์นี้จะมีการอัพเดทอยู่เสมอ
              เพื่อให้ข้อมูลที่ถูกต้องและทันสมัยที่สุด
              และสามารถนำไปใช้ประโยชน์ได้จริง
            </p>  
            </div>
          <div className="flex my-1">
            <EggFried color="yellow" className="w-[130px] h-[100px] p-2" />
            <p>
              <span className="text-lg font-semibold text-[#ff0]">หาก</span>ท่านมีข้อสงสัยหรือข้อเสนอแนะ สามารถติดต่อได้ที่ช่องทางการติดต่อในเว็บไซต์นี้
              ขอบคุณที่ให้ความสนใจและเยี่ยมชมเว็บไซต์ของเรา
              หวังว่าข้อมูลที่นำเสนอจะเป็นประโยชน์ต่อท่าน
              และช่วยให้ท่านมีความรู้เกี่ยวกับไข่และเมนูอาหารที่ทำจากไข่ชนิดต่างๆ มากยิ่งขึ้น
            </p>
          </div>
          <p>
            <span className="text-lg font-semibold text-[#ff0]">ขอบคุณค่ะ</span>
          </p>
        </div>

        {/* <div className="
              w-[100%] sm:w-[80%] text-center pt-4 text-lg font-semibold 
              flex flex-col justify-center items-center mx-auto
        ">
          <ul className="list-disc">
            <li>
              <EggFried className="h-30 w-30 p-2 rounded-full" />
                เว็บไซต์นี้จัดทำขึ้นเพื่อเผยแพร่ข้อมูลเกี่ยวกับไข่ 
                และเมนูอาหารที่ทำจากไข่ชนิดต่างๆ ไม่ว่าจะเป็นไข่ไก่ ไข่เป็ด ไข่นกกระทา ไข่มดแดง ซึ่งจะกล่าวถึงไข่ไก่เป็นหลัก
                เพราะนอกจากไข่ไก่จะมีคุณค่าทางโภชนาการแล้วยังมีราคาไม่แพง
                และหาซื้อได้ง่ายตามท้องตลาดทั่วไป           
            </li>
            <li>
              ไข่ไก่เป็นแหล่งโปรตีนที่มีคุณภาพสูง
              มีกรดอะมิโนที่จำเป็นต่อร่างกาย
              และมีวิตามินและแร่ธาตุที่สำคัญต่อการเจริญเติบโตและพัฒนาการของร่างกาย
            </li>
            <li>
              เว็บไซต์นี้ จึงมีวัตถุประสงค์เพื่อให้ข้อมูลที่ถูกต้องและเป็นประโยชน์
              สำหรับผู้ที่สนใจเกี่ยวกับไข่และเมนูอาหารที่ทำจากไข่ชนิดต่างๆ 
              เพื่อให้ผู้ที่สนใจ สามารถรับทราบข้อมูลได้ครอบคลุมที่สุดในที่เดียว
            </li>
            <li>
              โดยข้อมูลที่นำเสนอในเว็บไซต์นี้จะมีการอัพเดทอยู่เสมอ
              เพื่อให้ข้อมูลที่ถูกต้องและทันสมัยที่สุด
              และสามารถนำไปใช้ประโยชน์ได้จริง
            </li>
            <li>
              หากท่านมีข้อสงสัยหรือข้อเสนอแนะ สามารถติดต่อได้ที่ช่องทางการติดต่อในเว็บไซต์นี้
              ขอบคุณที่ให้ความสนใจและเยี่ยมชมเว็บไซต์ของเรา
              หวังว่าข้อมูลที่นำเสนอจะเป็นประโยชน์ต่อท่าน
              และช่วยให้ท่านมีความรู้เกี่ยวกับไข่และเมนูอาหารที่ทำจากไข่ชนิดต่างๆ มากยิ่งขึ้น
            </li>
            <li>
              ขอบคุณค่ะ
            </li>
          </ul>
        </div> */}
      </div>
    </section>
  )
}
export default About