

export const EggSalt = [
    {
        ingredeints: [
            'ไข่เป็ด',
            'น้ำเปล่า',
            'น้ำส้มสายชู',
            'เกลือป่น',
            'ขวดโหล',
            'ชามกระเบื้อง',
            'ตะกร้า',
        ],
        steps: [
            {
                id: 1,
                image: '/images/info/salt/salt1.jpg',
                step: `นำไข่เป็ด ( แนะนำให้ใช้ไข่เป็ดไล่ทุ่ง ชนิดเบอร์ 0/ขนาดใหญ่สุด) 
                        เพื่อจะได้คุณภาพของไข่แดงใหญ่ สีสดสวย  จำนวนฟองตามแต่ต้องการ  
                        มาล้างทำความสะอาดในน้ำเปล่า ให้สะอาดปราศจากสิ่งปนเปื้อนใด ๆ`,    
            },
            {
                id: 2,
                image: '/images/info/salt/salt2.jpg',
                step: `นำไข่เป็ดที่ล้างสะอาดแล้ว ผึ่งในตะกร้าให้แห้ง`,    
            },
            {
                id: 3,
                image: '/images/info/salt/salt3.jpg',
                step: `นำไข่เป็ดที่แห้งแล้วมาจัดวางเรียงไว้ในภาชนะประเภทกระเบื้องเคลือบ 
                          แล้วเทน้ำส้มสายชูลงไป ให้ท่วมไข่ แช่ทิ้งไว้ประมาณ    5-10 นาที  
                          เพื่อให้เปลือกไข่อ่อนนุ่ม  เกลือป่นสามารถดูดซึมเข้าสู่ลูกไข่ได้โดยง่าย`,    
            },
            {
                id: 4,
                image: '/images/info/salt/salt4.jpg',
                step: `นำไข่เป็ดมาพอกด้วยเกลือป่น คลุกเคล้าให้ทั่วทั้งใบ`,    
            },
            {
                id: 5,
                image: '/images/info/salt/salt5.jpg',
                step: `จัดวางเรียงไว้ในโหลแก้ว ปิดฝาให้สนิท  ทิ้งไว้ประมาณ  5- 7 วัน`,    
            },
            {
                id: 6,
                image: '/images/info/salt/salt6.jpg',
                step: `เมื่อครบกำหนด  5 วัน สามารถนำมาทอดเป็นไข่ดาวได้ และเมื่อครบกำหนด  7  วัน 
                          ให้นำมาต้ม ใช้เวลาต้มประมาณ 10 นาที จะได้ไข่เค็มที่เนื้อไข่ขาวนุ่ม ไข่แดงสีสันสดสวย รสชาติอร่อย น่ารับประทาน.`,    
            },
        ] 
    },
    
]