

export const DessertData = [
    {
        id: 1,
        title: "ไข่อบมันเทศ",
        description: "ไข่อบมันเทศอร่อยๆ ที่ทำง่าย รวดเร็ว และแคลอรี่ต่ำ",
        image: "/images/dessert/sw1.jpg",
        ingredient: [
            'ไข่ไก่',
            'มันเทศหรือ มันหวาน',
            'พริกไทยป่น',
            'ชีส',
        ],
        todo: [
            'นำมันเทศไปนึ่งให้สุก',
            'เมื่อมันเทศสุกแล้วทำการผ่าครึ่งเป็นทางยาว',
            'ใช้ช้อนคว้านเนื้อมันเทศตรงกลางออกพอประมาณ แล้วนำเนื้อมันเทศที่คว้านออกนั้นใส่ถ้วยพักไว้',
            'ตอกไข่ดิบลงไปแทนที่เนื้อมันเทศที่ถูกคว้านออก จากนั้นนำไปอบในเตาอบที่อุณหภูมิ 200 องศาเซลเซียส ประมาณ 10 นาที หรือจนกว่าไข่จะสุก เป็นอันเสร็จเรียบร้อยสำหรับเมนูนี้',
            'ตอกไข่ใส่ลงไปในเนื้อมันเทศที่คว้านออก จากนั้นยีไข่กับเนื้อมันเทศเข้าด้วยกัน แล้วโรยหน้าด้วยพริกไทย และชีส',
            'นำไปอบในเตาอบที่อุณหภูมิ 200 องศาเซลเซียส ประมาณ 10 นาที หรือจนกว่าไข่จะสุก',
            'เสิร์ฟไข่อบมันเทศอร่อยๆ ได้เลย',
        ],
    },
    {
        id: 2,
        title: "ฝอยทอง",
        description: "",
        image: "/images/dessert/sw3.jpg",
        ingredient: [
            'น้ำตาลทรายขาว 1 กิโลกรัม',
            'น้ำลอยดอกมะลิ  1,000 มิลลิลิตร (หรือน้ำสะอาดหยดกลิ่นมะลิ 2-3 หยด)',
            'ใบเตยมัดรวมกัน 4 ใบ',
            'ไข่เป็ด 6 ฟอง',
            'ไข่ไก่ 3 ฟอง',
        ],
        todo: [
            'ทำน้ำเชื่อม โดยตั้งหม้อใส่น้ำตาลทรายกับน้ำลอยดอกมะลิเข้าด้วยกัน ใส่ใบเตยลงไป เอาไปตั้งไฟประมาณ 5 นาทีหรือรอจนน้ำตาลละลาย เสร็จแล้วกรองด้วยกระชอนตาถี่หรือผ้าขาวบาง เทใส่กระทะทองเหลือง เคี่ยวด้วยไฟอ่อนจนเหนียวข้น',
            'ตอกไข่ทั้งสองชนิดใส่ถ้วย แยกไข่แดงกับไข่ขาวออกจากกัน ใช้แต่ไข่แดง และรีดไข่น้ำค้างเทลงไปในไข่แดง (เคล็ดลับ : ไข่น้ำค้างทำให้เส้นฝอยทองเหนียวนุ่ม ไม่ขาดง่าย) ตีผสมให้เป็นเนื้อเดียวกัน แต่ไม่ต้องตีให้ขึ้นฟู เพราะถ้าคนมากไปจะทำให้เส้นขาดเวลาโรย นำไปกรองในผ้าขาวบาง',
            'ตักไข่แดงใส่ในกรวย โรยไข่ลงไปในน้ำเชื่อมพอเดือดใช้ไฟกลาง วนให้รอบกระทะทองเหลืองประมาณ 20-30 รอบต่อชิ้น ยกกรวยขึ้น',
            'พอสุกให้ใช้ไม้ปลายแหลมพับครึ่งเส้นฝอยทองแล้วเอามาพักบนตะแกรงให้สะเด็ดน้ำเชื่อม (เคล็ดลับ : ถ้าต้องการฝอยทองเส้นเล็ก ให้ถือกรวยสูงจากน้ำเชื่อมเยอะหน่อย แต่ถ้าต้องการฝอยทองเส้นใหญ่ ก็ให้ถือกรวยต่ำ ๆ)',
        ],
    },
    {
        id: 3,
        title: "สังขยามะพร้าวอ่อน",
        description: "",
        image: "/images/dessert/sw10.jpg",
        ingredient: [
            'มะพร้าวอ่อน 3 ลูก',
            'ไข่ 3 ฟอง (ไข่เป็ด 2 ฟอง ไข่ไก่ 1 ฟอง)',
            'หัวกะทิ 150-200 กรัม',
            'น้ำตาลทราย 150 กรัม',
            'ใบเตย 3-4 ใบ',
            'เกลือ',
        ],
        todo: [
            'เฉาะด้านบนมะพร้าว เทน้ำออก เตรียมไว้',
            'นำส่วนผสมทุกอย่างใส่รวมกัน ขยำเข้าด้วยกันจนน้ำตาลละลาย กรองด้วยผ้าขาวบาง ตักใส่ลูกมะพร้าว',
            'นำไปวางบนลังถึงที่มีน้ำเดือด ปิดฝา เบาไฟลง นึ่งประมาณ 20 นาทีหรือจนสุก จัดเสิร์ฟ หรือเอาไปแช่เย็นก็อร่อย',
        ],
    },
    {
        id: 4,
        title: "ขนมหม้อแกง",
        description: "",
        image: "/images/dessert/sw13.jpg",
        ingredient: [
            'ถั่วเขียวนึ่งบดละเอียด 200 กรัม',
            'ไข่เป็ด 5 ฟอง',
            'ใบเตย',
            'น้ำตาลปี๊บ 250 กรัม',
            'หัวกะทิ 400 กรัม',
            'หอมแดงซอย 50 กรัม',
            'น้ำมันพืช',
        ],
        todo: [
            'เริ่มต้นที่เจียวหอมแดงก่อน โดยใส่น้ำมันพืชลงในกระทะตามด้วยหอมแดง เจียวให้เหลืองตักขึ้น',
            'ตอกไข่ลงในชาม นำใบเตยที่ล้างทำความสะอาดอย่างดีแล้วใส่ลงไป (เพื่อขยำให้ไข่ขึ้นฟู) ขยำใบเตยจนไข่ขึ้นฟู ใส่น้ำตาลปี๊บลงไป ขยำให้เข้ากันดี เติมหัวกะทิ ขยำอีกรอบให้เข้ากัน นำไปกรอง อาจจะกรองด้วยผ้าขาวบาง 1 รอบหรือ กรองด้วยกระชอน 1 รอบ และกรองด้วยผ้าขาวบางอีก 1 รอบ',
            'หลังกรองเสร็จก็ใส่ถั่วเขียวนึ่งและบดลงไปใช้มือขยำหรือวน ๆ คน ๆ ให้ถั่วไม่เป็นก้อน',
            'นำกระทะไปตั้งไฟเพื่อกวนส่วนผสมขนม เริ่มจากใส่น้ำมันหอมเจียว 3 ช้อนโต๊ะ เพื่อให้ขนมมีกลิ่นหอมและชูรสชาติให้อร่อยขึ้น ใส่ส่วนผสมขนมลงไปกวน ประมาณ 5 นาที หรือจนขนมข้นขึ้น ยกลงเทใส่พิมพ์',
            'ขยับ ๆ ส่าย ๆ พิมพ์สักหน่อยเพื่อให้หน้าขนมเรียบเสมอกัน นำเข้าไปอบที่อุณหภูมิ 180 องศาเซลเซียส ถึง 200 องศาเซลเซียส นาน 40 นาที (แล้วแต่เตาอบ) พอสุกแล้วเอาออกจากเตา พักให้เย็นสักครู่ค่อยตัดให้เป็นชิ้นสวยงาม สุดท้ายโรยหอมเจียว พร้อมเสิร์ฟ',
        ],
    },
    {
        id: 5,
        title: "สังขยาไข่",
        description: "",
        image: "/images/dessert/sw9.jpg",
        ingredient: [
            'ไข่ไก่ 10 ฟอง',
            'น้ำตาลปี๊บ 100 กรัม',
            'หัวกะทิ 1 ถ้วยตวง',
        ],
        todo: [
            'ผสมไข่ไก่ น้ำตาลปี๊บ และหัวกะทิให้เข้ากัน นำไปกรองผ่านตะแกรง เทใส่ภาชนะสำหรับนึ่ง',
            'นึ่งสังขยานานประมาณ 15 นาทีหรือจนสุกยกลง พักไว้จนเย็น พร้อมรับประทาน',
        ],
    },
]


